In [5]:
import pandas as pd
df=pd.read_csv("house-train.csv",usecols=["GarageQual","FireplaceQu","SalePrice"])

In [6]:
df.head()

  FireplaceQu GarageQual  SalePrice
0         NaN         TA     208500
1          TA         TA     181500
2          TA         TA     223500
3          Gd         TA     140000
4          TA         TA     250000

In [7]:
df.isnull().mean()

FireplaceQu    0.472603
GarageQual     0.055479
SalePrice      0.000000
dtype: float64

In [8]:
X=df
y=df["SalePrice"]

In [9]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=2)

In [10]:
X_train['GarageQual_imputed']=X_train["GarageQual"]
X_test["GarageQual_imputed"]=X_test["GarageQual"]

X_train["FireplaceQu_imputed"]=X_train["FireplaceQu"]
X_test["FireplaceQu_imputed"]=X_test["FireplaceQu"]

In [11]:
X_train

     FireplaceQu GarageQual  SalePrice GarageQual_imputed FireplaceQu_imputed
455           TA         TA     175500                 TA                  TA
863          NaN         TA     132500                 TA                 NaN
504           Fa         TA     147000                 TA                  Fa
1413          Gd         TA     257000                 TA                  Gd
1389          Gd         TA     131000                 TA                  Gd
...          ...        ...        ...                ...                 ...
466           Po         TA     167000                 TA                  Po
299           Gd         TA     158500                 TA                  Gd
493           Fa         TA     155000                 TA                  Fa
527           Gd         TA     446261                 TA                  Gd
1192         NaN         TA     125000                 TA                 NaN

[1168 rows x 5 columns]

In [ ]:
X_train